k-epsilon/2D_capsule_v2/capsule_from_prism/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (                  0               -0.1                 -4 )  // 0 v9b
    (                  0                0.1                 -4 )  // 1 v9f
    (             1.0353               -0.1            -3.8637 )  // 2 v8b
    (             1.0353                0.1            -3.8637 )  // 3 v8f
    (             2.8284               -0.1            -2.8284 )  // 4 v7b
    (             2.8284                0.1            -2.8284 )  // 5 v7f
    (            -1.4378               -0.1            -2.5357 )  // 6 v10b
    (            -1.4378                0.1            -2.5357 )  // 7 v10f
    (                  0               -0.1               -0.2 )  // 8 c8b
    (                  0                0.1               -0.2 )  // 9 c8f
    (              -0.04               -0.1              -0.16 )  // 10 c9b
    (              -0.04                0.1              -0.16 )  // 11 c9f
    (              -0.08               -0.1              -0.12 )  // 12 c10b
    (               0.08               -0.1              -0.12 )  // 13 c7b
    (              -0.08                0.1              -0.12 )  // 14 c10f
    (               0.08                0.1              -0.12 )  // 15 c7f
    (                 -2               -0.1                  0 )  // 16 v1b
    (              -0.12               -0.1                  0 )  // 17 c1b
    (               0.08               -0.1                  0 )  // 18 c6b
    (                  4               -0.1                  0 )  // 19 v6b
    (                 -2                0.1                  0 )  // 20 v1f
    (              -0.12                0.1                  0 )  // 21 c1f
    (               0.08                0.1                  0 )  // 22 c6f
    (                  4                0.1                  0 )  // 23 v6f
    (              -0.08               -0.1               0.12 )  // 24 c2b
    (               0.08               -0.1               0.12 )  // 25 c5b
    (              -0.08                0.1               0.12 )  // 26 c2f
    (               0.08                0.1               0.12 )  // 27 c5f
    (              -0.04               -0.1               0.16 )  // 28 c3b
    (              -0.04                0.1               0.16 )  // 29 c3f
    (                  0               -0.1                0.2 )  // 30 c4b
    (                  0                0.1                0.2 )  // 31 c4f
    (            -1.4378               -0.1             2.5357 )  // 32 v2b
    (            -1.4378                0.1             2.5357 )  // 33 v2f
    (             2.8284               -0.1             2.8284 )  // 34 v5b
    (             2.8284                0.1             2.8284 )  // 35 v5f
    (             1.0353               -0.1             3.8637 )  // 36 v4b
    (             1.0353                0.1             3.8637 )  // 37 v4f
    (                  0               -0.1                  4 )  // 38 v3b
    (                  0                0.1                  4 )  // 39 v3f
);

edges
(
  arc 21 26 (         -0.107938                0.1           0.068404) // capsuleFront12 (c1f c2f)
  arc 17 24 (         -0.107938               -0.1           0.068404) // capsuleBac12 (c1b c2b)
  arc 20 33 ( -1.90884651807325                0.1   1.04188906600158) // inletFront12 (v1f v2f)
  arc 16 32 ( -1.90884651807325               -0.1   1.04188906600158) // inletBack12 (v1b v2b)
  arc 37 35 (                 2                0.1   3.46410161513775) // outletFront45 (v4f v5f)
  arc 36 34 (                 2               -0.1   3.46410161513775) // outletBack45 (v4b v5b)
  arc 35 23 (  3.68201941380976                0.1    1.5629245139571) // outletFront56 (v5f v6f)
  arc 34 19 (  3.68201941380976               -0.1    1.5629245139571) // outletBack56 (v5b v6b)
  arc 23 5 (  3.68201941380976                0.1   -1.5629245139571) // outletFront67 (v6f v7f)
  arc 19 4 (  3.68201941380976               -0.1   -1.5629245139571) // outletBack67 (v6b v7b)
  arc 5 3 (                 2                0.1  -3.46410161513775) // outletFront78 (v7f v8f)
  arc 4 2 (                 2               -0.1  -3.46410161513775) // outletBack78 (v7b v8b)
  arc 7 20 ( -1.90884651807325                0.1  -1.04188906600158) // inletFront1011 (v10f v1f)
  arc 6 16 ( -1.90884651807325               -0.1  -1.04188906600158) // inletBack1011 (v10b v1b)
  arc 14 21 (         -0.107938                0.1          -0.068404) // capsuleFront1011 (c10f c1f)
  arc 12 17 (         -0.107938               -0.1          -0.068404) // capsuleBack1011 (c10b c1b)
  spline 33 39                      // inletFrontSpline (v2f v3f)
     (
         (   -1.4378467222199                0.1    2.5357095704442 )  // None ifs0
         (  -1.27808597530658                0.1   2.85662793054101 )  // None ifs1
         (  -1.11832522839325                0.1   3.13501684022407 )  // None ifs2
         ( -0.958564481479933                0.1   3.37215112572645 )  // None ifs3
         ( -0.798803734566611                0.1   3.56930561328126 )  // None ifs4
         ( -0.639042987653289                0.1   3.72775512912159 )  // None ifs5
         ( -0.479282240739967                0.1   3.84877449948054 )  // None ifs6
         ( -0.319521493826644                0.1   3.93363855059119 )  // None ifs7
         ( -0.159760746913322                0.1   3.98362210868665 )  // None ifs8
         (                  0                0.1                  4 )  // None ifs9

     )

  spline 32 38                      // inletBackSpline (v2b v3b)
     (
         (   -1.4378467222199               -0.1    2.5357095704442 )  // None ibs0
         (  -1.27808597530658               -0.1   2.85662793054101 )  // None ibs1
         (  -1.11832522839325               -0.1   3.13501684022407 )  // None ibs2
         ( -0.958564481479933               -0.1   3.37215112572645 )  // None ibs3
         ( -0.798803734566611               -0.1   3.56930561328126 )  // None ibs4
         ( -0.639042987653289               -0.1   3.72775512912159 )  // None ibs5
         ( -0.479282240739967               -0.1   3.84877449948054 )  // None ibs6
         ( -0.319521493826644               -0.1   3.93363855059119 )  // None ibs7
         ( -0.159760746913322               -0.1   3.98362210868665 )  // None ibs8
         (                  0               -0.1                  4 )  // None ibs9

     )

  spline 37 39                      // outletFrontSpline (v4f v3f)
     (
         (   1.03527618041008                0.1   3.86370330515627 )  // None ofs0
         (  0.920245493697851                0.1   3.89273088818244 )  // None ofs1
         (   0.80521480698562                0.1   3.91819525953359 )  // None ofs2
         (  0.690184120273389                0.1   3.94013599144673 )  // None ofs3
         (  0.575153433561157                0.1   3.95859265615888 )  // None ofs4
         (  0.460122746848926                0.1   3.97360482590704 )  // None ofs5
         (  0.345092060136694                0.1   3.98521207292822 )  // None ofs6
         (  0.230061373424463                0.1   3.99345396945944 )  // None ofs7
         (  0.115030686712231                0.1   3.99837008773769 )  // None ofs8
         (                  0                0.1                  4 )  // None ofs9

     )

  spline 36 38                      // outletBackSpline (v4b v3b)
     (
         (   1.03527618041008               -0.1   3.86370330515627 )  // None obs0
         (  0.920245493697851               -0.1   3.89273088818244 )  // None obs1
         (   0.80521480698562               -0.1   3.91819525953359 )  // None obs2
         (  0.690184120273389               -0.1   3.94013599144673 )  // None obs3
         (  0.575153433561157               -0.1   3.95859265615888 )  // None obs4
         (  0.460122746848926               -0.1   3.97360482590704 )  // None obs5
         (  0.345092060136694               -0.1   3.98521207292822 )  // None obs6
         (  0.230061373424463               -0.1   3.99345396945944 )  // None obs7
         (  0.115030686712231               -0.1   3.99837008773769 )  // None obs8
         (                  0               -0.1                  4 )  // None obs9

     )

  spline 3 1                      // outletFrontSplineBottom (v8f v9f)
     (
         (   1.03527618041008                0.1  -3.86370330515627 )  // None ofs0
         (  0.920245493697851                0.1  -3.89273088818244 )  // None ofs1
         (   0.80521480698562                0.1  -3.91819525953359 )  // None ofs2
         (  0.690184120273389                0.1  -3.94013599144673 )  // None ofs3
         (  0.575153433561157                0.1  -3.95859265615888 )  // None ofs4
         (  0.460122746848926                0.1  -3.97360482590704 )  // None ofs5
         (  0.345092060136694                0.1  -3.98521207292822 )  // None ofs6
         (  0.230061373424463                0.1  -3.99345396945944 )  // None ofs7
         (  0.115030686712231                0.1  -3.99837008773769 )  // None ofs8
         (                  0                0.1                 -4 )  // None ofs9

     )

  spline 2 0                      // outletBackSplineBottom (v8b v9b)
     (
         (   1.03527618041008               -0.1  -3.86370330515627 )  // None obs0
         (  0.920245493697851               -0.1  -3.89273088818244 )  // None obs1
         (   0.80521480698562               -0.1  -3.91819525953359 )  // None obs2
         (  0.690184120273389               -0.1  -3.94013599144673 )  // None obs3
         (  0.575153433561157               -0.1  -3.95859265615888 )  // None obs4
         (  0.460122746848926               -0.1  -3.97360482590704 )  // None obs5
         (  0.345092060136694               -0.1  -3.98521207292822 )  // None obs6
         (  0.230061373424463               -0.1  -3.99345396945944 )  // None obs7
         (  0.115030686712231               -0.1  -3.99837008773769 )  // None obs8
         (                  0               -0.1                 -4 )  // None obs9

     )

  spline 7 1                      // inletFrontSplineb (v10f v9f)
     (
         (   -1.4378467222199                0.1   -2.5357095704442 )  // None ifs0
         (  -1.27808597530658                0.1  -2.85662793054101 )  // None ifs1
         (  -1.11832522839325                0.1  -3.13501684022407 )  // None ifs2
         ( -0.958564481479933                0.1  -3.37215112572645 )  // None ifs3
         ( -0.798803734566611                0.1  -3.56930561328126 )  // None ifs4
         ( -0.639042987653289                0.1  -3.72775512912159 )  // None ifs5
         ( -0.479282240739967                0.1  -3.84877449948054 )  // None ifs6
         ( -0.319521493826644                0.1  -3.93363855059119 )  // None ifs7
         ( -0.159760746913322                0.1  -3.98362210868665 )  // None ifs8
         (                  0                0.1                 -4 )  // None ifs9

     )

  spline 6 0                      // inletBackSplineb (v10b v9b)
     (
         (   -1.4378467222199               -0.1   -2.5357095704442 )  // None ibs0
         (  -1.27808597530658               -0.1  -2.85662793054101 )  // None ibs1
         (  -1.11832522839325               -0.1  -3.13501684022407 )  // None ibs2
         ( -0.958564481479933               -0.1  -3.37215112572645 )  // None ibs3
         ( -0.798803734566611               -0.1  -3.56930561328126 )  // None ibs4
         ( -0.639042987653289               -0.1  -3.72775512912159 )  // None ibs5
         ( -0.479282240739967               -0.1  -3.84877449948054 )  // None ibs6
         ( -0.319521493826644               -0.1  -3.93363855059119 )  // None ibs7
         ( -0.159760746913322               -0.1  -3.98362210868665 )  // None ibs8
         (                  0               -0.1                 -4 )  // None ibs9

     )

);

blocks
(
    hex (33 26 24 32 20 21 17 16) b1 (41 1 26) simpleGrading (0.001 1 1)  // b1 (v2f c2f c2b v2b v1f c1f c1b v1b)
    hex (39 29 28 38 33 26 24 32) b2 (41 1 19) simpleGrading (0.001 1 1)  // b2 (v3f c3f c3b v3b v2f c2f c2b v2b)
    hex (37 31 30 36 39 29 28 38) b3 (41 1 16) simpleGrading (0.001 1 1)  // b3 (v4f c4f c4b v4b v3f c3f c3b v3b)
    hex (35 27 25 34 37 31 30 36) b4 (41 1 33) simpleGrading (0.001 1 1)  // b4 (v5f c5f c5b v5b v4f c4f c4b v4b)
    hex (23 22 18 19 35 27 25 34) b5 (41 1 27) simpleGrading (0.001 1 1)  // b5 (v6f c6f c6b v6b v5f c5f c5b v5b)
    hex (5 15 13 4 23 22 18 19) b6 (41 1 27) simpleGrading (0.001 1 1)  // b6 (v7f c7f c7b v7b v6f c6f c6b v6b)
    hex (3 9 8 2 5 15 13 4) b7 (41 1 33) simpleGrading (0.001 1 1)  // b7 (v8f c8f c8b v8b v7f c7f c7b v7b)
    hex (1 11 10 0 3 9 8 2) b8 (41 1 16) simpleGrading (0.001 1 1)  // b8 (v9f c9f c9b v9b v8f c8f c8b v8b)
    hex (7 14 12 6 1 11 10 0) b9 (41 1 19) simpleGrading (0.001 1 1)  // b9 (v10f c10f c10b v10b v9f c9f c9b v9b)
    hex (20 21 17 16 7 14 12 6) b10 (41 1 26) simpleGrading (0.001 1 1)  // b10 (v1f c1f c1b v1b v10f c10f c10b v10b)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (33 20 16 32)  // f-b1-w (v2f v1f v1b v2b)
            (39 33 32 38)  // f-b2-w (v3f v2f v2b v3b)
            (37 39 38 36)  // f-b3-w (v4f v3f v3b v4b)
            (1 3 2 0)  // f-b8-w (v9f v8f v8b v9b)
            (7 1 0 6)  // f-b9-w (v10f v9f v9b v10b)
            (20 7 6 16)  // f-b10-w (v1f v10f v10b v1b)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (35 37 36 34)  // f-b4-w (v5f v4f v4b v5b)
            (23 35 34 19)  // f-b5-w (v6f v5f v5b v6b)
            (5 23 19 4)  // f-b6-w (v7f v6f v6b v7b)
            (3 5 4 2)  // f-b7-w (v8f v7f v7b v8b)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (26 24 17 21)  // f-b1-n (c2f c2b c1b c1f)
            (29 28 24 26)  // f-b2-n (c3f c3b c2b c2f)
            (31 30 28 29)  // f-b3-n (c4f c4b c3b c3f)
            (27 25 30 31)  // f-b4-n (c5f c5b c4b c4f)
            (22 18 25 27)  // f-b5-n (c6f c6b c5b c5f)
            (15 13 18 22)  // f-b6-n (c7f c7b c6b c6f)
            (9 8 13 15)  // f-b7-n (c8f c8b c7b c7f)
            (11 10 8 9)  // f-b8-n (c9f c9b c8b c8f)
            (14 12 10 11)  // f-b9-n (c10f c10b c9b c9f)
            (21 17 12 14)  // f-b10-n (c1f c1b c10b c10f)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
