k-epsilon/2D_capsule_v2/capsule_from_prism/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8e-02;

deltaT          1e-07;

writeControl    adjustableRunTime;

writeInterval   1e-03;

purgeWrite      0;

writeFormat     ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     7;

runTimeModifiable true;

adjustTimeStep    yes;

maxCo             1.0;

functions
{
    #includeFunc MachNo
    #includeFunc yPlus
    #includeFunc residuals
    //#includeFunc scalarTransport
}

// ************************************************************************* //
