k-epsilon/2D_capsule_v2/capsule_from_prism/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "p.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|e|R).*"
    {
        $p;
        tolerance       1e-05;
    }

    "(k|epsilon).*"
    {
        $p;
        tolerance       1e-08;
    }
}

//PIMPLE
"(PIMPLE|PISO|SIMPLE)"
{

    nNonOrthogonalCorrectors   0;
    nCorrectors                1;
    nOuterCorrectors         100;
    transonic            yes; 
    
    residualControl
    {
	p  1e-5;
	U  1e-5;
	"(k|epsilon|omega)" 1e-5;
    }
    outerCorrectorResidualControl
    {
        U
        {
                tolerance  1e-5;
                relTol        0;
        }
        p
        {
                tolerance  5e-4;
                relTol        0;
        }
     }
}

relaxationFactors
{
    fields
    {
        p      0.3;
        pFinal   1;
    }
    equations
    {
        "U|k|epsilon"     0.3;
        "(U|k|epsilon)Final"   1;
    }
}
// ************************************************************************* //
